"""
Домашнє завдання №8: Selenium - робота з чекбоксами

Preconditions:
1. Завдання виконувати на сторінці https://demoqa.com/checkbox

Завдання:
1. Шляхом передавання списку вигляду ['Home', 'Documents', 'Office'] у відповідний метод
    частково розгорнути дерево чекбоксів, відповідно до назв папок переданих в списку
2. Шляхом передавання списку вигляду ['Public', 'Private'] у відповідний метод
    обрати чекбокси (поставити галочки) на відповідних пунктах
3. Перевірити в асерті (assert) що обрані саме ті пункти, назви яких передали в списку
    (public, private)
"""
